
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;        
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		МенеджерЗаписи = РегистрыСведений.ИсторияЦенТоваров.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Дата;
		МенеджерЗаписи.Номенклатура = ТекСтрокаТовары.Номенклатура;            
	    МенеджерЗаписи.Цена = ТекСтрокаТовары.Цена;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры
